<?php

/* @var $this yii\web\View */

$this->title = 'Расписание ВятГУ';
?>
<!--div class="site-index">

    <div class="jumbotron">
		<h4>Министерство науки и высшего образования РФ</h4>
		<h4>ФГБОУ ВО «ВЯТСКИЙ ГОСУДАРСТВЕННЫЙ УНИВЕРСИТЕТ»</h4>
		<br>
		<h4>Факультет компьютерных и физико-математических наук</h4>
		<h4>Кафедра фундаментальной математики</h4>
		<br>
		<h4>Выпускная квалификационная работа</h4>
		<h4>по направлению подготовки</h4>
		<h4>02.04.01 Математика и компьютерные науки</h4>
		<br>
		<h4>на тему <i>«Разработка интерактивного сервиса "Расписание учебных занятий" для студентов и преподавателей ВятГУ»</i></h4>
		
		<p class="lead"><b>Выполнил:</b> студент МКм-2301-51-00 Булатов Дмитрий Игоревич</p>
		<p class="lead"><b>Научный руководитель:</b> кандидат физ.-мат. наук, доцент Марков Роман Владимирович</p>
		
    </div>

    <div class="body-content">

        <div class="row">
            <div class="col-lg-4">
                <h4>Цель</h4>
                <p>Создание сервиса, предназначенного для отображения расписания преподавателей ВятГУ,
				с возможностью внесения изменений и добавлением комментариев</p>
				<h4>Актуальность</h4>
				<p>Разработка инструментов для удобного поиска расписания, внедрение обратной связи от преподавателей.</p>
            </div>
            <div class="col-lg-4">
                <h4>Задачи</h4>

                <p>
					<b>1 - </b>Изучить существующий вариант расписания для ВятГУ<br>
					<b>2 - </b>Проанализировать и составить оптимизированныую структуру представления расписания<br>
					<b>3 - </b>Разработать алгоритмы, необходимые для отображения расписания<br>
					<b>4 - </b>Разработать алгоритмы, позволяющие вносить изменения и добавлять комментарии в расписание<br>
				</p>

                
            </div>
            <div class="col-lg-4">
                <h4><div class="hide_or_show_result">Заключение</div></h4>

                <p class="result_class" style="display: none;">
					<b>Удалось</b> разработать удобный сервис, отображающий расписание в удобном виде.<br>
					<b>Удалось</b> настроить взаимодействие сервиса с базой данных и официальным сайтом.<br>
					<b>Не удалось</b> разработать модуль для внесения изменений и комментариев в расписание
				</p>
            </div>
        </div>

    </div>
</div-->
<script>
</script>
